#include<stdio.h>
#include<locale.h>
main()
{
	setlocale(LC_ALL, "RUS");
	puts("1.");
	printf("%20s\n", "Это текст");
	printf("%s", "Этот текст");
	printf("%s\n", "Этот текст");
	printf("%10.3f\n", 12.234657);
	printf("%10.5f\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n", 7, 5, 7 % 5);
	printf("Произведение %d на %d равно %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n", 5., 2., 5. / 2);

	puts("2.");
	int N = 22, K = 14, M = 1, R = 46, B = 50400;
	printf(" Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", K);
	printf("До полуночи осталось %d часов и %d минут\n", M, R);
	printf("C 8.00 прошло %d секунд\n", B);
	printf("Текущий час=%d/24 суток и текущая минута = %d/60 часа\n", N, K);

	puts("3.");
	printf("%s\n\t", "Дано:");
	int n = 3;
	printf("%d\n\t", n);
	printf("%d\n\t", 333);
	puts("___________");
	printf("%s\n\t", "Ответ:");
	printf("%+08.3f", n / 333.);
}